Revit 2026 API

# DocumentNewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method

---

Creates a new Area BoundaryConditions element on a host element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundaryConditions NewAreaBoundaryConditions(
	Element hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
```
```vb
Public Function NewAreaBoundaryConditions (
	hostElement As Element,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double
) As BoundaryConditions
```
```cpp
public:
BoundaryConditions^ NewAreaBoundaryConditions(
	Element^ hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
```
```fsharp
member NewAreaBoundaryConditions :
        hostElement : Element *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float -> BoundaryConditions
```

#### Parameters

hostElement Element
     A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation TranslationRotationValue
     A value indicating the X axis translation option.
X_TranslationSpringModulus Double
     Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
     A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
     Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
     A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
     Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".

#### Return Value

BoundaryConditionsIf successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 2 - "Area".  is returned if the operation fails.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the host element does not exist in the given document. |

This method will only function with the Autodesk Revit Structure application.

#### Reference

Document Class

NewAreaBoundaryConditions Overload

Autodesk.Revit.Creation Namespace